Repository: JamesLinus/Debian-Administrator-Handbook
Catalog: */00a_preface.po
Languages: ar_ma

source: Preface
ar_ma: مقدمة

source: Debian is a very successful operating system, which is pervasive in our digital lives more than people often imagine or are aware of. A few data points will suffice to make this clear. At the time of writing Debian is the most popular GNU/Linux variant among web servers: according to <ulink url="http://w3techs.com/">W3Techs</ulink>, more than 10% of the web is Debian-powered. Think about it: how many web sites would have you missed today without Debian? Onto more fascinating deployments, Debian is the operating system of choice on the International Space Station. Have you been following the work of ISS astronauts, maybe via the social network presence of NASA or other international organizations? Both the work in itself and the posts about it have been made possible by Debian. Countless companies, universities, and public administrations rely on Debian daily for their operations, delivering services to millions of users around the world... and its orbit!
ar_ma: دبيان نظام تشغيل ناجح جداً يتغلل في حياتنا الرقمية أكثر مما يتصور أو يعي الناس أحياناً. بضعة أرقام تكفي لتوضيح هذا. ففي وقت كتابتنا دبيان هي أكثر توزيعة غنو/لينكس شعبية على مخدمات الوب: حسب إحصائيات <ulink url="http://w3techs.com/">W3Techs</ulink>، فإن أكثر من ‎10% من الوب يعتمد على دبيان. فكر بالموضوع: كم عدد مواقع الوب التي لم تكن لتراها اليوم لولا نظام دبيان؟ وعلى صعيد أكثر تشويقاً، دبيان هي أيضاً نظام التشغيل المعتمد في محطة الفضاء الدولية. هل كنت تتابع أعمال رواد محطة الفضاء الدولية أو غيرها من المنظمات الدولية، عبر صفحات الشبكات الاجتماعية ربما؟ دبيان تدعم هذه الأعمال والأخبار التي تُنشَر. تعتمد أعداد لا تحصى من الشركات، والجامعات، والمكاتب الحكومية على دبيان يومياً لإنجاز أعمالها، وتقديم خدماتها لملايين المستخدمين حول العالم... وفي الفضاء أيضاً!

source: But Debian is much more than an operating system, no matter how complex, featureful, and reliable such a system could be. Debian is a vision of the freedoms that people should enjoy in a world where more and more of our daily activities depend on software. Debian is born from the cardinal Free Software idea that people should be in control of their computers, and not the other way around. People with enough software knowledge should be able to dismantle, modify, reassemble and share with others all the software that matters to them. It doesn't matter if the software is used for frivolous activities like posting pictures of kittens on the Web, or for potentially life-threatening tasks such as driving our cars and powering the medical devices which cure us — and Debian is used in all of the above scenarios; you should control it. People without in-depth software knowledge should enjoy those freedoms too: they should be able to delegate to people of their choice, people they trust, the audit or modification of software-based devices on their behalf.
ar_ma: لكن دبيان أكثر بكثير من مجرد نظام تشغيل، مهما كان تعقيد نظام التشغيل هذا ومهما كانت مزاياه واستقراره. دبيان هو تعبير عن الحريات التي يجب أن يتمتع بها الناس في عالم أصبحت فيه نشاطاتنا اليومية تعتمد على البرمجيات أكثر فأكثر. دبيان هي ثمرة فكرة حرية البرمجيات بأن الناس يجب أن يتحكموا بحواسيبهم، لا أن تتحكم بهم الحواسيب. يجب أن يسمح لأصحاب الخبرة الكافية في البرمجيات بتفكيك وإعادة تجميع ومشاركة البرمجيات التي تهمهم مع الآخرين. لا فرق إذا كانت البرمجيات تستخدم لأنشطة بسيطة مثل نشر صور القطط على الوب، أو لمهام حرجة كقيادة سياراتنا أو تشغيل الأجهزة الطبية التي تعالجنا — ودبيان يستخدم في تلك الحالات كافة؛ يجب أن تتحكم أنت بها. حتى الناس الذين لا يملكون خبرة برمجية عميقة يجب أن يتمتعوا بهذه الحريات أيضاً: يجب أن يسمح لهم بتفويض الأشخاص الذين يختارونهم، والذين يثقون بهم، لفحص أو تعديل أجهزتهم التي تعمل بالبرمجيات.

source: In the quest for the control of people over machines, Free operating systems play a fundamental role: you cannot be in full control of a computer device if you do not control its operating system. This is where Debian's main ambition comes from: producing the best, entirely Free operating system. For more than 20 years now, Debian has both developed a Free operating system and promoted a vision of Free Software around it. In so doing, Debian has set a very high bar for software freedom advocates around the world. Debian's decisions on matters of software licensing, for example, are routinely looked to by international standard organizations, governments, and other Free Software projects, when deciding if something should be considered “free enough” or not.
ar_ma: في سبيل التحكم بالآلات والسيطرة عليها، تلعب نظم التشغيل الحرة دوراً أساسياً: فلا يمكنك الوصول إلى التحكم الكامل بالحاسوب إذا لم تتحكم بنظام تشغيله. هذا هو طموح دبيان الرئيسي: إنتاج أفضل نظام تشغيل حر بالكامل. منذ أكثر من عشرين عاماً حتى اليوم، استمر مشروع دبيان بتطوير نظام تشغيل حر وتعزيز رؤيا حرية البرمجيات من حوله. بذلك كان دبيان محط تطلعات أنصار البرمجيات الحرة حول العالم. فمنظمات المعايير العالمية والحكومات ومشاريع البرمجيات الحرة الأخرى –مثلاً– تراجع قرارات دبيان حول قضايا ترخيص البرمجيات دورياً لتقرر إذا كان أحد الأشياء يعتبر ”حراً بما يكفي“ أم لا.

source: But this political vision is not yet enough to explain Debian's uniqueness. Debian is also a very peculiar social experiment, strongly attached to its independence. Think for a moment of other mainstream Free Software distributions, or even of popular <emphasis>proprietary</emphasis> operating systems. Chances are that you can associate each of them with a large company that is either the main development force behind the project, or at the very least the steward of all its non-development activities. Debian is different. Within the Debian Project volunteers pack on themselves the responsibilities of all the activities that are needed to keep Debian alive and kicking. The variety of those activities is stunning: from translations to system administration, from marketing to management, from conference organization to artwork design, from bookkeeping to legal issues... not to mention software packaging and development! Debian contributors take care of all of these.
ar_ma: لكن هذه الرؤية السياسية لا تكفي لتبرير تميُّز دبيان. دبيان تجربة اجتماعية فريدة جداً، ترتبط بشدة باستقلالها. فكر قليلاً بتوزيعات البرمجيات الحرة الأساسية الأخرى، أو حتى بنظم التشغيل <emphasis>المحتكرة</emphasis> الشهيرة. ستستطيع –غالباً– ربط كل منها بإحدى الشركات الكبيرة التي تمثل قوة التطوير الأساسية في المشروع، أو أنها على الأقل مسؤولة عن كافة النشاطات غير التطويرية. لكن دبيان مختلف. في مشروع دبيان، يأخذ المتطوعون على عاتقهم مسؤولية المهام الضرورية للحفاظ على حياة دبيان ونشاطه كلها. تنوع هذه المهام مذهل: من الترجمة إلى إدارة النظم، ومن التسويق إلى الإدارة، من تنظيم الاجتماعات إلى التصميم الفني، من المحاسبة المالية إلى القضايا القانونية، ... ناهيك عن تحزيم البرمجيات والتطوير! يهتم المساهمون في مشروع دبيان بكل هذه النواحي.

source: As a first consequence of this radical form of independence, Debian needs and relies on a very diverse community of volunteers. Any skill in any of the above areas, or others you can imagine, can be invested into Debian and will be used to improve the project. A second consequence of Debian independence is that Debian's choices can be trusted not to be driven by the commercial interests of specific companies — interests that we have no guarantee will always be aligned with the goal of promoting people's control over machines, as too many recent examples in the tech news testify.
ar_ma: إحدى أولى النتائج المترتبة على هذا الاستقلال الثوري هي حاجة دبيان لمجتمع شديد التنوع من المتطوعين ليعتمد عليه. أي مهارة في أي من المجالات السابقة، أو غيرها مما يخطر لك، يمكن استثمارها في دبيان وسوف تستخدم لتحسين المشروع. من النتائج الأخرى لاستقلالية دبيان هي أنك تستطيع الثقة بأن خيارات المشروع لن تقودها الأهواء التجارية لشركة ما — وهي أهواء لا يمكن أن يضمن لنا أحد أنها ستتفق دائماً مع هدف تعزيز سيطرة البشر على الآلات، كما تشهد على ذلك أمثلة عديدة في الأخبار التقنية مؤخراً.

source: One last aspect contributes to Debian's uniqueness: the way in which the social experiment is run. Despite the folklore of being bureaucratic, decision making in Debian is in fact highly distributed. There exist clearly defined areas of responsibility within the project. People in charge of those areas are free to drive their own boat. As long as they keep up with the quality requirements agreed upon by the community, no one can tell them what to do or how to do their job. If you want to have a say on how something is done in Debian, you need to put yourself on the line and be ready to take the job on your shoulders. This peculiar form of meritocracy — which we sometimes call <emphasis>do-ocracy</emphasis> — is very empowering for contributors. Anyone with enough skills, time, and motivation can have a real impact on the direction the project is taking. This is testified by a population of about 1 000 official members of the Debian Project, and several thousands of contributors world-wide. It is no wonder that Debian is often credited as the largest community-driven Free Software project in existence.
ar_ma: هناك ناحية أخيرة تساهم في تميُّزِ دبيان: ألا وهي طريقة قيادة هذه التجربة الاجتماعية. فبدلاً من البيروقراطية التقليدية، عملية اتخاذ القرار في دبيان موزعة في معظمها. هناك نطاقات مسؤولية محددة بوضوح ضمن المشروع. يتمتع الأشخاص المسؤولون عن هذه النطاقات بحرية اتخاذ القرار. وطالما أنهم يواكبون متطلبات الجودة التي يوافق عليها المجتمع، فلا يحق لأحد أن يقول لهم ما يفعلونه أو يملي عليهم طريقة عملهم. هذا الشكل الفريد من الميريتوقراطية — التي ندعوها أحياناً الفعلوقراطية (<emphasis>do-ocracy</emphasis>) — يمنح المساهمين صلاحيات واسعة. فأي شخص يملك المهارات اللازمة والوقت الكافي والدافع يستطيع التأثير بشكل حقيقي على توجّه المشروع. يشهد على ذلك أعضاء مشروع دبيان الرسميون الذين يبلغ عددهم الألف تقريباً، وبضعة آلاف من المساهمين حول العالم. لا عجب أن يشار لمشروع دبيان على أنه أكبر مشروع برمجيات حرة حي يقوده المجتمع.

source: So Debian is quite unique. Are we the only ones noticing this? Definitely not. According to <ulink url="http://distrowatch.com/">DistroWatch</ulink> there are about 300 active Free Software distributions around. Half of that (about 140) are Debian <emphasis>derivatives</emphasis>. That means that they start from Debian, adapt it to fit the needs of their users — usually by adding, modifying, and rebuilding packages — and release the resulting product. In essence, derivatives apply the Free Software granted freedoms of modifying and redistributing copies not only to individual pieces of software, but to a distribution as a whole. The potential of reaching out to new Free Software users and contributors by the means of derivative distributions is huge. We believe that it is mainly thanks to that thriving ecosystem that Free Software is nowadays finally rivaling with proprietary software in fields which were historically considered hard to conquer, such as large desktop deployments. Debian sits at the root of the largest ecosystem of Free Software distributions in existence: even if you are not using Debian directly, and even if your distributor has not told you, chances are that you are benefiting right now from the work of the Debian community.
ar_ma: دبيان متميز جداً إذن. هل نحن وحدنا من يدرك هذا؟ قطعاً لا. وفقاً لموقع <ulink url="http://distrowatch.com/">DistroWatch</ulink> هناك حوالي 300 توزيعة برمجيات حرة نشطة حالياً. نصف ذلك العدد (حوالي 140) <emphasis>مشتقة</emphasis> من دبيان. هذا يعني أنهم يبدؤون من دبيان، ثم يعدلونها لتناسب حاجات مستخدميهم — عبر إضافة وتعديل وإعادة بناء الحزم عادة — ويطلقون المنتج النهائي. أساساً، التوزيعات المشتقة لا تقصر تطبيق الحريات التي تمنحها البرمجيات الحرة من تعديل وإعادة توزيع على البرمجيات المفردة وحسب، بل تطبقها على التوزيعة ككل أيضاً. احتمال الوصول لمستخدمين جدد للبرمجيات الحرة من خلال التوزيعات المشتقة كبير جداً. نحن نعتقد أن هذا النظام المزدهر هو السبب الرئيسي وراء وصول البرمجيات الحرة هذه الأيام أخيراً إلى منافسة البرمجيات المحتكرة في مجالات كانت تعتبر تاريخياً صعبة المنال، مثل النشر على أعداد كبيرة من الحواسيب المكتبية. يتربع دبيان على عرش أكبر منظومة من توزيعات البرمجيات الحرة في الوجود: وحتى لو لم تكن تستخدم دبيان مباشرة، وحتى لو لم يخبرك موزعك بذلك، الأغلب أنك تستفيد الآن من جهود مجتمع دبيان.

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, or books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author's/publisher's reputation.
ar_ma: لكن تميّز دبيان ينتج أحياناً عواقب غير متوقعة. فطموح دبيان بتحقيق الحرية الرقمية فرض علينا إعادة تعريف معنى كلمة <emphasis>برمجيات</emphasis>. لقد أدرك مشروع دبيان منذ زمن طويل أنك تحتاج توزيع كمية كبيرة من المواد غير البرمجية كجزء من نظام التشغيل: موسيقى، صور، وثائق، بيانات خام، تعريفات للأجهزة، الخ. لكن كيف يمكنك تطبيق حرية <emphasis>البرمجيات</emphasis> على تلك المواد؟ هل نحتاج لتعريف متطلبات جديدة لحرية تلك المواد أو هل يجب أن تتمتع كل الأجزاء بنفس معايير الحرية الصارمة؟ اختار مشروع دبيان الطريق الثاني: ويجب أن تقدم جميع المواد التي توزع كجزء من دبيان نفس الحريات للمستخدمين. هذا الموقف الفلسفي المتطرف له باع طويل جداً. فهو يعني أننا لا نستطيع توزيع تعريفات الأجهزة إذا لم تكن حرة، ولا الأعمال الفنية التي لا يمكن استخدامها تجارياً، ولا الكتب التي لا يمكن تعديلها لتفادي تشويه سمعة المؤلف أو الناشر (كما هي عادات دور نشر الكتب).

source: The book you have in your hands is different. It's a <emphasis>free as in freedom</emphasis> book, a book which is up to Debian freedom standards for every aspect of your digital life. For a very long time, the scarce availability of books like this one has been a significant shortcoming of Debian. It meant that there was little reading material that helped to spread Debian and its values, while at the same time embodying those values and showing off their advantages. But it also meant, ironically, that we had little such material that we could distribute as part of Debian itself. This is the first reputable book to address this shortcoming. You can <command>apt install</command> this book, you can redistribute it, you can fork this book or, better, submit bug reports and patches for it, so that others in the future can benefit from your contributions. The “maintainers” of this book — who are also its authors — are longstanding members of the Debian Project, who grok the freedom ethos that permeates every aspect of Debian and know first-hand what it means to take on the responsibility for important parts of Debian. By releasing this Free book they are doing, once more, such a wonderful service to the Debian community.
ar_ma: هذا الكتاب الذي بين يديك مختلف. هو كتاب حر، <emphasis>free as in freedom</emphasis>، كتاب يتوافق مع معايير دبيان لحرية جميع نواحي حياتك الرقمية. كانت ندرة الكتب الحرة مثل هذا الكتاب إحدى أهم نقائص دبيان لفترة طويلة جداً من الزمن. هذا يعني أن المواد المقروءة التي تساعد على نشر دبيان وقِيَمِه، مع تجسيد هذه القيم وإبراز منافعها، قليلة. كما يعني أننا لم نكن نستطيع توزيع إلا القليل من هذه المواد كجزء من مشروع دبيان نفسه. أنت تقرأ أول كتاب قيّم يحارب هذا النقص. يمكنك الحصول على هذا الكتاب من مستودعات دبيان عبر <command>apt install</command>، ويمكنك إعادة توزيعه، كما يمكنك الاشتقاق منه، أو إرسال تقارير الأخطاء والترقيعات إليه، حتى يستفيد الآخرون من مساهماتك في المستقبل. ”المشرفان“ على هذا الكتاب — وهما مؤلفاه أيضاً — هما عضوان قديمان في مشروع دبيان تشرّبا أخلاقيات الحرية التي تجري في عروق دبيان كلها، وتعرفا بأيديهما على معنى تولي مسؤولية الأجزاء المهمة في دبيان. وبإطلاقهما لهذا الكتاب الحر فهما يقدمان جميلاً عظيماً لمجتمع دبيان مرة أخرى.

source: We hope you will enjoy this cornerstone of Debian reading Freedom as much as we did.
ar_ma: نتمنى أن يعجبك حجر الأساس هذا في صرح حرية القراءة في مشروع دبيان كما أعجبنا.

source: October 2015
ar_ma: أكتوبر 2015

source: Stefano Zacchiroli (Debian Project Leader 2010-2013), Lucas Nussbaum (Debian Project Leader 2013-2015) and Neil McGovern (Debian Project Leader 2015-incumbent)
ar_ma: ستيفانو زاتشيرولي (قائد مشروع دبيان 2010-2013) و لوكاس ناسبوم (قائد مشروع دبيان 2013-2015) ونيل ماك جوفيرن (قائد مشروع دبيان 2015-حتى الوقت الحاضر)
